Show / Hide Table of Contents
Class RebarSegment3DLine
Represents a line segment in 3D space.
Inheritance
System.Object
OpenObject
RebarSegment3DBase
RebarSegment3DLine
Inherited Members
 RebarSegment3DBase.EndPoint
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public class RebarSegment3DLine : RebarSegment3DBase
 Improve this Doc
 View Source